{"title": "IPv4 packet header",
  "source": {"title": "RFC 791", "url": "https://tools.ietf.org/html/rfc791"},
  "description": "The Internet Protocol is designed for use in interconnected systems of packet-switched computer communication networks. The internet protocol provides for transmitting blocks of data called datagrams from sources to destinations, where sources and destinations are hosts identified by fixed length addresses. The internet protocol also provides for fragmentation and reassembly of long datagrams, if necessary, for transmission through \"small packet\" networks.",
  "bitblocks":  [
    {"bits" : 4, "name" : "Version", "description" : "The Version field indicates the format of the internet header. ie. IPv4 or IPv6."},
    {"bits" : 4, "name" : "Internet Header Length", "description" : "Length of the header in multiples of 4 bytes. Note that the minimum value for a correct header is 5."},
    {"bits" : 8, "name" : "Type of Service", "description" : "Also referred to as Quality of Service (QoS). Describes what priority the packet should have."},
    {"bits" : 16, "name" : "Length", "description" : "Total Length is the length of the datagram, measured in octets, including internet header and data. This field allows the length of a datagram to be up to 65,535 octets. Such long datagrams are impractical for most hosts and networks. All hosts must be prepared to accept datagrams of up to 576 octets (whether they arrive whole or in fragments)."},
    {"bits" : 16, "name" : "Identification Tag", "description" : "An identifying value assigned by the sender to aid in assembling the fragments of a datagram."},
    {"bits" : 1, "name" : "Zero Flag", "description" : "Must Be Zero."},
    {"bits" : 1, "name" : "DF Flag", "description" : "<ul><li>0 = May Fragment</li><li>1 = Don't Fragment.</li></ul>"},
    {"bits" : 1, "name" : "MF Flag", "description" : "<ul><li>0 = Last Fragment</li><li>1 = More Fragments.</li></ul>"},
    {"bits" : 13, "name" : "Fragment Offset", "description" : "Identifies the position of the fragment within original packet. The fragment offset is measured in units of 8 octets (64 bits). The first fragment has offset zero."},
    {"bits" : 8, "name" : "Time To Live (TTL)", "description" : "<p>This field indicates the maximum time the datagram is allowed to remain in the internet system. </p><p> If this field contains the value zero, then the datagram must be destroyed.</p><p> This field is modified in internet header processing. The time is measured in units of seconds, but since every module that processes a datagram must decrease the TTL by at least one even if it process the datagram in less than a second, the TTL must be thought of only as an upper bound on the time a datagram may exist. The intention is to cause undeliverable datagrams to be discarded, and to bound the maximum datagram lifetime.</p>"},
    {"bits" : 8, "name" : "Protocol", "description" : "Protocol used (TCP, UDP, ICMP, etc.). Specified in \"Assigned Numbers\". See <a href='https://tools.ietf.org/html/rfc790'>RFC 790</a> for more information."},
    {"bits" : 16, "name" : "Header Checksum", "description" : "A checksum on the header only. Since some header fields change (e.g., time to live), this is recomputed and verified at each point that the internet header is processed."},
    {"bits" : 32, "name" : "Source IP Address", "description" : ""},
    {"bits" : 32, "name" : "Destination IP Address", "description" : ""}
  ]
}
